dataframe

In [44]:
import pandas as pd
import numpy as np

In [45]:
data = np.random.randn(4,3)

In [46]:
dataFrame=pd.DataFrame(data)

In [47]:
dataFrame

          0         1         2
0 -0.368231  0.683234  0.437005
1 -0.839665 -0.231012 -1.265076
2  1.267795 -1.442844  1.283411
3 -0.333635 -0.924168  0.645542

In [48]:
yeniDataFrame = pd.DataFrame(data,index=["sabri","basri","osman","mahmut"],columns=["maas","yas","calisma saati"])

In [49]:
yeniDataFrame

            maas       yas  calisma saati
sabri  -0.368231  0.683234       0.437005
basri  -0.839665 -0.231012      -1.265076
osman   1.267795 -1.442844       1.283411
mahmut -0.333635 -0.924168       0.645542

In [50]:
yeniDataFrame["yas"]

sabri     0.683234
basri    -0.231012
osman    -1.442844
mahmut   -0.924168
Name: yas, dtype: float64

In [51]:
yeniDataFrame["calisma saati"]

sabri     0.437005
basri    -1.265076
osman     1.283411
mahmut    0.645542
Name: calisma saati, dtype: float64

In [52]:
yeniDataFrame[["maas","yas"]]

            maas       yas
sabri  -0.368231  0.683234
basri  -0.839665 -0.231012
osman   1.267795 -1.442844
mahmut -0.333635 -0.924168

In [53]:
yeniDataFrame.loc["sabri"]

maas            -0.368231
yas              0.683234
calisma saati    0.437005
Name: sabri, dtype: float64

In [55]:
yeniDataFrame.loc["osman"]

maas             1.267795
yas             -1.442844
calisma saati    1.283411
Name: osman, dtype: float64

In [56]:
yeniDataFrame["Emeklilik Yasi"]=yeniDataFrame["yas"]+yeniDataFrame["yas"]

In [57]:
yeniDataFrame

            maas       yas  calisma saati  Emeklilik Yasi
sabri  -0.368231  0.683234       0.437005        1.366468
basri  -0.839665 -0.231012      -1.265076       -0.462023
osman   1.267795 -1.442844       1.283411       -2.885687
mahmut -0.333635 -0.924168       0.645542       -1.848335

In [59]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1)

            maas       yas  calisma saati
sabri  -0.368231  0.683234       0.437005
basri  -0.839665 -0.231012      -1.265076
osman   1.267795 -1.442844       1.283411
mahmut -0.333635 -0.924168       0.645542

In [61]:
yeniDataFrame.drop("osman",axis=0)

            maas       yas  calisma saati  Emeklilik Yasi
sabri  -0.368231  0.683234       0.437005        1.366468
basri  -0.839665 -0.231012      -1.265076       -0.462023
mahmut -0.333635 -0.924168       0.645542       -1.848335

In [62]:
yeniDataFrame

            maas       yas  calisma saati  Emeklilik Yasi
sabri  -0.368231  0.683234       0.437005        1.366468
basri  -0.839665 -0.231012      -1.265076       -0.462023
osman   1.267795 -1.442844       1.283411       -2.885687
mahmut -0.333635 -0.924168       0.645542       -1.848335

In [63]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)

In [64]:
yeniDataFrame

            maas       yas  calisma saati
sabri  -0.368231  0.683234       0.437005
basri  -0.839665 -0.231012      -1.265076
osman   1.267795 -1.442844       1.283411
mahmut -0.333635 -0.924168       0.645542

In [66]:
yeniDataFrame.loc["sabri"]["yas"]

0.6832342371977035

In [67]:
yeniDataFrame.loc["sabri","yas"]

0.6832342371977035

In [68]:
yeniDataFrame

            maas       yas  calisma saati
sabri  -0.368231  0.683234       0.437005
basri  -0.839665 -0.231012      -1.265076
osman   1.267795 -1.442844       1.283411
mahmut -0.333635 -0.924168       0.645542

In [69]:
yeniDataFrame<0

         maas    yas  calisma saati
sabri    True  False          False
basri    True   True           True
osman   False   True          False
mahmut   True   True          False

In [71]:
yeniDataFrame[yeniDataFrame>0]

            maas       yas  calisma saati
sabri        NaN  0.683234       0.437005
basri        NaN       NaN            NaN
osman   1.267795       NaN       1.283411
mahmut       NaN       NaN       0.645542

In [72]:
booleanFrame=yeniDataFrame<0

In [73]:
yeniDataFrame[booleanFrame]

            maas       yas  calisma saati
sabri  -0.368231       NaN            NaN
basri  -0.839665 -0.231012      -1.265076
osman        NaN -1.442844            NaN
mahmut -0.333635 -0.924168            NaN

In [74]:
yeniDataFrame["yas"]

sabri     0.683234
basri    -0.231012
osman    -1.442844
mahmut   -0.924168
Name: yas, dtype: float64

In [76]:
yeniDataFrame[yeniDataFrame["yas"]>0]

           maas       yas  calisma saati
sabri -0.368231  0.683234       0.437005

In [78]:
yeniDataFrame[yeniDataFrame["calisma saati"]>0]

            maas       yas  calisma saati
sabri  -0.368231  0.683234       0.437005
osman   1.267795 -1.442844       1.283411
mahmut -0.333635 -0.924168       0.645542

In [79]:
yeniDataFrame

            maas       yas  calisma saati
sabri  -0.368231  0.683234       0.437005
basri  -0.839665 -0.231012      -1.265076
osman   1.267795 -1.442844       1.283411
mahmut -0.333635 -0.924168       0.645542

In [81]:
yeniDataFrame.reset_index()

    index      maas       yas  calisma saati
0   sabri -0.368231  0.683234       0.437005
1   basri -0.839665 -0.231012      -1.265076
2   osman  1.267795 -1.442844       1.283411
3  mahmut -0.333635 -0.924168       0.645542

In [82]:
yeniDataFrame

            maas       yas  calisma saati
sabri  -0.368231  0.683234       0.437005
basri  -0.839665 -0.231012      -1.265076
osman   1.267795 -1.442844       1.283411
mahmut -0.333635 -0.924168       0.645542

In [83]:
yeniDataFrame.reset_index(inplace=True)

In [84]:
yeniDataFrame

    index      maas       yas  calisma saati
0   sabri -0.368231  0.683234       0.437005
1   basri -0.839665 -0.231012      -1.265076
2   osman  1.267795 -1.442844       1.283411
3  mahmut -0.333635 -0.924168       0.645542

In [85]:
yeniIndexListesi=["sab","bas","osm","mah"]

In [86]:
yeniIndexListesi

['sab', 'bas', 'osm', 'mah']

In [87]:
yeniDataFrame["yeni Index"]=yeniIndexListesi

In [88]:
yeniDataFrame

    index      maas       yas  calisma saati yeni Index
0   sabri -0.368231  0.683234       0.437005        sab
1   basri -0.839665 -0.231012      -1.265076        bas
2   osman  1.267795 -1.442844       1.283411        osm
3  mahmut -0.333635 -0.924168       0.645542        mah

In [89]:
yeniDataFrame.set_index("yeni Index")

             index      maas       yas  calisma saati
yeni Index
sab          sabri -0.368231  0.683234       0.437005
bas          basri -0.839665 -0.231012      -1.265076
osm          osman  1.267795 -1.442844       1.283411
mah         mahmut -0.333635 -0.924168       0.645542

In [91]:
yeniDataFrame.set_index("yeni Index",inplace=True)

In [92]:
yeniDataFrame

             index      maas       yas  calisma saati
yeni Index
sab          sabri -0.368231  0.683234       0.437005
bas          basri -0.839665 -0.231012      -1.265076
osm          osman  1.267795 -1.442844       1.283411
mah         mahmut -0.333635 -0.924168       0.645542

In [93]:
yeniDataFrame.loc["sab"]

index               sabri
maas            -0.368231
yas              0.683234
calisma saati    0.437005
Name: sab, dtype: object

In [94]:
ilkIndeksler = ["Simson","Simson","Simson","South Park","South Park","South Park"]

In [102]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [103]:
birlesmisIndex = list(zip(ilkIndeksler,icIndeksler))

In [104]:
birlesmisIndex

[('Simson', 'Homer'),
 ('Simson', 'Bart'),
 ('Simson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [105]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [106]:
type(birlesmisIndex)

pandas.core.indexes.multi.MultiIndex

In [107]:
benimCizgiFilmlistem=[[40,"a"],[10,"b"],[30,"c"],[9,"d"],[10,"e"],[11,"f"]]

In [108]:
cizgiFilmNumpyDizisi=np.array(benimCizgiFilmlistem)

In [109]:
cizgiFilmDataframe=pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndex, columns=["yas","Meslek"])

In [110]:
cizgiFilmDataframe

                   yas Meslek
Simson     Homer    40      a
           Bart     10      b
           Marge    30      c
South Park Cartman   9      d
           Kenny    10      e
           Kyle     11      f

In [111]:
cizgiFilmDataframe.loc["Simson"]

      yas Meslek
Homer  40      a
Bart   10      b
Marge  30      c

In [112]:
cizgiFilmDataframe.loc["South Park"]

        yas Meslek
Cartman   9      d
Kenny    10      e
Kyle     11      f

In [113]:
cizgiFilmDataframe.loc["South Park"].loc["Kenny"]

yas       10
Meslek     e
Name: Kenny, dtype: object

In [114]:
cizgiFilmDataframe

                   yas Meslek
Simson     Homer    40      a
           Bart     10      b
           Marge    30      c
South Park Cartman   9      d
           Kenny    10      e
           Kyle     11      f

In [115]:
cizgiFilmDataframe.index.names=["Film adi","Isim"]

In [116]:
cizgiFilmDataframe

                   yas Meslek
Film adi   Isim
Simson     Homer    40      a
           Bart     10      b
           Marge    30      c
South Park Cartman   9      d
           Kenny    10      e
           Kyle     11      f